[{"grab":"**Hello world!!!**","views":" 2009, a new strain of influenza A (H1N1) was identified and quickly became a global pandemic. Infection preventionists (IPs) played a crucial role in helping healthcare agencies respond to this rapidly evolving event. However, the sudden outbreak and constantly changing guidance from various organizations created challenges for IPs in developing policies and procedures. Focus groups with IPs identified the need for concise, real-time infection prevention guidelines, as well as reference materials for non-acute care settings, occupational health policies, and multi-language patient education materials. IPs also need training on isolation precautions, coordination with community response agencies, and surge management. Collaboration between IPs and public health agencies is essential for addressing gaps in pandemic planning.\nBullet points\n\nThe 2009 H1N1 Influenza A Pandemic\n\nA novel strain of influenza A (H1N1) was identified in April 2009 and developed into a pandemic by June 2009\nThe World Health Organization (WHO) raised the pandemic phase to 5, indicating sustained human-to-human transmission in at least 2 countries\nThe Centers for Disease Control and Prevention (CDC) reported the first case of laboratory-confirmed novel H1N1 in the United States on April 15, 2009\nThe CDC declared a public health emergency on April 26th, and by May 3, 25% of the Strategic National Stockpile was deployed to aid states in responding to this event\nThe novel H1N1 outbreak was officially declared a pandemic by the WHO on June 11, 2009\nImpact on Infection Preventionists (IPs)\n\nIPs were on the frontlines during the early phase of the novel H1N1 outbreak, helping health care agencies develop policies and procedures to respond to this rapidly evolving event\nThe surge of infected individuals and 'worried well' taxed hospitals and health care agencies around the world\nInfection prevention guidance related to novel H1N1 patient management came out sporadically from various organizations, including the WHO and CDC and health departments across the United States\nFocus Group Results\n\nFocus groups were conducted at the Association for Professionals in Infection Control and Epidemiology, Inc, (APIC) 2009 conference to evaluate IPs’ experience with the novel H1N1 influenza pandemic\nNeeded reference materials identified by attendees included infection prevention guidance for nonacute care settings, occupational health policies, and brief, multi-language patient/family educational materials\nEducational topics on which IPs need to be trained include isolation precautions/personal protective equipment recommendations for novel H1N1 patients, coordination between hospitals and community response agencies, and surge management\nThe rapidly changing and conflicting recommendations related to patient management made responding to this event challenging\nIPs require synthesized infection prevention guidelines developed in a concise, real-time format\nConclusion\n\nIPs must continue to partner with public health and other response agencies to address gaps in pandemic planning\nLessons learned from this event should guide future pandemic planning efforts\nIntroduction\n\nThe study was conducted by Terri Rebmann and Wagner from the Institute of Biosecurity, Saint Louis University, School of Public Health, and Safety Management Services, Inc.\nThe purpose of the study was to evaluate the experiences of Infection Preventionists (IPs) during the novel H1N1 influenza pandemic and assess their perceived needs for future education and reference materials.\nThe study was conducted to support APIC’s goal of providing timely information relevant to novel H1N1 and to complement the work of APIC’s Emergency Preparedness Committee.\nMethods\n\nThe authors developed the questions for the study and invited all members of APIC who were registered for the APIC 2009 Annual Educational Conference and International Meeting to participate in the focus groups.\nThe inclusion criteria was being involved in the direct response to the 2009 novel H1N1 flu pandemic.\nThe nominal group method and focus group method were used to elicit information on the topics of interest and details from participants’ experience with the novel H1N1 influenza pandemic.\nParticipants were informed that information collected would remain anonymous and that all responses were voluntary.\nFocus group sessions were audiotaped, and the digital recordings were transcribed verbatim. Content analysis was used to identify, code, and categorize participants’ responses to the questions of interest, and major themes that emerged were identified and categorized.\nSubjects’ demographic data were obtained for descriptive statistics, and participants were asked to complete an 11-item survey related to the novel H1N1 flu pandemic.\nResults\n\n40 participants took part in the 3 focus groups\nMost focus group participants (93%) were IPs\nParticipants had a wide range of experiences in responding to the novel H1N1 flu pandemic\nParticipants reported that they had to quickly learn about the novel H1N1 flu and adapt to changing information and guidelines\nParticipants reported that they had to develop and implement new policies and procedures related to the novel H1N1 flu\nParticipants reported that they had to communicate with a variety of stakeholders, including staff, patients, and the public, about the novel H1N1 flu\nParticipants reported that they had to balance the need for infection prevention and control with the need to maintain operations and patient care\nParticipants reported that they had to deal with shortages of personal protective equipment (PPE) and other resources\nParticipants reported that they had to deal with misinformation and confusion about the novel H1N1 flu\nParticipants reported that they had to deal with the emotional impact of the novel H1N1 flu on themselves and their colleagues\nDiscussion\n\nThe study highlights the unique experiences of IPs during the novel H1N1 influenza pandemic and their perceived needs for future education and reference materials.\nThe study provides lessons learned for other IPs and should guide future pandemic planning efforts.\nDemographic characteristics of focus group participants\n\n72.5% (n=29) of the participants worked in a hospital\n12.5% (n=5) worked in public health\n10.0% (n=4) worked in ambulatory care\n10.0% (n=4) worked in home health\n7.5% (n=3) worked in long-term care\n51.7% (n=15) of the participants worked in facilities with 101-250 beds\n92% (n=36) of the participants were female\n45.0% (n=22) of the participants were aged 50 years or older\n58% (n=23) of the participants had a master’s degree or more education\n67.5% (n=27) of the participants were certified in infection control\nInfection prevention issues in alternate care sites and nonacute care settings\n\nMany focus group participants reported a lack of infection prevention guidance for alternate care sites and nonacute care settings such as physician offices, ambulatory care clinics, long-term care, nursing homes, and others\nIt was difficult to manage novel H1N1 patients in this setting without guidance\nThere is a general lack of infection prevention information and guidance related to occupational health issues\nParticipants recommended that APIC and/or other organizations should provide education and guidance for occupational health professionals\nTable 2. Reference materials/products that received the most votes during the Nominal Group Method portion of the focus groups\n\nThe specific reference materials/products are not provided in the text\nTable 3. Education topics that received the most votes during the Nominal Group Method portion of the focus groups\n\nThe specific education topics are not provided in the text\nAdditional themes that emerged from the focus groups\n\nThere is a general lack of infection prevention information and guidance related to occupational health issues\nParticipants recommended that APIC and/or other organizations should provide education and guidance for occupational health professionals\nThe facility bed size ranged from 29 (a small, rural facility) to 17,000 (a large, international multiagency health care system)\n\nApproximately half of the attendees worked in an urban area (53%, n521)\nOnly 15% (n56) were from a rural area\nMost attendees worked in a hospital (73%, n 5 29), public health agency (13%, n 5 5), home health (10%, n 5 4), or ambulatory care setting (10%, n 5 4).\n\nThe facility bed size ranged from 29 (a small, rural facility) to 17,000 (a large, international multiagency health care system)\nApproximately half of the attendees worked in an urban area (53%, n521); only 15% (n56) were from a rural area.\n\nThe majority of at- tendees was female (90%, n 5 36) and aged 50 years or older (70%, n 5 28). Approximately half had a mas- ter’s degree or more education (58%, n 5 23). Twenty- seven participants (68%) were certified in infection control.\nNeed for better infection prevention guidelines in occupational health\n\nFocus group participants suggest a potential partnership between APIC and the American Association of Occupational Health Nurses to develop these guidelines\nSpecific occupational health issue: managing or preventing ill healthcare providers coming to work sick\nMoney may be a reason for employees working while sick\nMore administrative support and better human resource policies are needed related to furloughing staff and sick leave practices during pandemics\nChallenges in employee health and safety issues\n\nMonitoring and managing employee health and safety issues during pandemics is important but challenging\nDuring the novel H1N1, there was a lack of guidance for ambulatory care and public health did not bring in any help\nReference materials needed for current and future pandemics\n\nInfection prevention guidance for non-acute care settings is needed\nInfection prevention guidance related to occupational health issues is needed\nEvidence-based information for physician education is needed\nPatient and family educational materials that are brief and available in multiple languages are needed\nPatient management materials that are brief are needed\nIsolation precautions materials that are brief and simple in electronic format are needed\nCommunication procedures when supplies run out are needed\nInfection prevention guidance for pediatric facilities is needed\nResource management tool for supply allocation during a variety of events is needed\nScreening tools and forms that are simple to use are needed\nAlgorithm/check list outlining steps of an outbreak investigation is needed\nNote: The order of importance for the topics is determined by the Nominal Group Method.\nImportant Education Topics for Future IP Training\n\nIsolation precautions and personal protective equipment recommendations for novel H1N1\nCoordination and communication with community response agencies (resource management, funding, supply allocation, and others)\nSurge management\nInfection preventionists’ role in emergency management for all hazards\nPreparedness and management of an event (acute, ambulatory, home health)\nEmployee education related to pandemic planning\nResource management and allocation during an event (eg, par levels, anti-infective therapy, PPE, prioritization)\nClinical description of novel H1N1 (epidemiology, signs/symptoms, transmission, treatment, control measures, and others)\nChallenges in Implementing Recommendations\n\nOccupational health issues and employee compensation\nChanging and conflicting standards and recommendations\nMaintaining staff compliance and trust in the face of rapidly changing recommendations\nInterpretation of inconsistent guidance from various agencies\nSources of Information\n\nCDC\nState health departments\nWHO\nAPIC\nRapid Changes in Recommendations\n\nCase definition changed multiple times\nRecommendations changed rapidly and frequently\nDifficulty in staying abreast of latest recommendations\nConflicting Guidelines\n\nCDC, state, and local health departments had different guidelines\nDifficulty in interpreting conflicting guidelines\nChallenges in implementing rapidly changing recommendations for infection prevention\n\nRapidly changing and conflicting recommendations for infection prevention caused confusion among healthcare professionals\nHealthcare providers questioned the credibility of Infection Preventionists (IPs) due to constantly changing messages\nMaintaining credibility for the IP department was difficult due to frequent changes in recommendations\nStaff had a hard time trusting the information provided by IPs\nStaff compliance with infection prevention practices\n\nInitial response to novel H1N1 saw positive staff adherence to infection prevention practices\nStaff compliance with infection prevention started to wane as the event wore on\nHealthcare workers' perceptions of the severity of novel H1N1 led to poor compliance with Personal Protective Equipment (PPE)\nStaff compliance with influenza vaccination is expected to increase as healthcare workers are eager to get vaccinated for influenza this year\nFactors affecting compliance with infection prevention\n\nHealthcare workers' perceptions of the severity of novel H1N1 led to poor compliance with PPE\nHealthcare workers' trust in IPs and the information provided by them affects compliance with infection prevention practices\nImplications for infection prevention strategies\n\nIt is important to maintain clear and consistent communication with healthcare professionals regarding infection prevention recommendations\nBuilding trust with healthcare workers is crucial to ensure compliance with infection prevention practices\nStrategies to maintain staff vigilance in the midst of outbreaks are necessary\nNote:\n\nThe above summary is based on the provided text and may not cover all the nuances of the discussion.\nThe text is a part of a larger study and should be interpreted in the context of the full study.\nReferences:\n\nRebmann and Wagner, e9\nChallenges in communication during the 2\n\nChallenges in obtaining Tamiflu\n\nDuring the H1N1 pandemic, there was a shortage of Tamiflu, and local distributors were only able to provide 6 doses per day\nThe strategic national stockpile was not readily available, making it impossible for hospitals to obtain more\nHospitals were concerned about having enough Tamiflu for their staff, as they are essential for taking care of patients\nTheft of supplies\n\nDuring the H1N1 pandemic, there were reports of boxes of masks and respirators disappearing quickly in hospitals\nSome hospitals even reported entire pallets of supplies being stolen\nTo combat this, hospitals kept supplies under lock and key\nIssues with mutual aid agreements\n\nDuring the H1N1 pandemic, mutual aid agreements were not honored, leaving hospitals to obtain resources and supplies on their own\nHospitals expressed frustration with this, as they were following the guidelines and were not receiving support from other hospitals\nChallenges with masks and respirators\n\nHospitals had difficulty obtaining the correct masks and respirators during the H1N1 pandemic\nThere were issues with fit testing a large number of staff in a short period of time\nHospitals ran out of masks and respirators during the pandemic\nMask and Respirator Usage During Novel H1N1 Outbreak\n\n26.5% of participants stated that their facility ran out of respiratory protection during their response to novel H1N1\nMany health care staff did not understand why their facility could not obtain more N95 respirators\nApproximately 23.5% of participants reported implementing a policy to reuse respiratory protection to conserve supplies\nSome participants stated that respirators were available but not in the correct size or style\nLack of sufficient and appropriate supplies led to unexpected challenges and suboptimal situations\nMost participants (80.0%) reported that they used a N95 respirator or equivalent as respiratory protection for staff\n11.4% of participants used an N95 respirator with a surgical mask on top of it\n8.6% of participants had staff wear only a surgical mask\nOne third of all participants reported conflicting guidelines related to isolation, mask, and/or respirator use for novel H1N1 patient management\nChallenges in Obtaining Adequate Supplies\n\nParticipants discussed the challenge of obtaining adequate supplies of respiratory protection during the initial wave of the novel H1N1 pandemic\nSome participants stated that respirators were available but not in the correct size or style\nLack of sufficient and appropriate supplies led to unexpected challenges and suboptimal situations\nConflicting Guidelines\n\nParticipants stated that it was very difficult to determine appropriate isolation and PPE use for novel H1N1 patient management\nMost participants (80.0%) reported that they used a N95 respirator or equivalent as respiratory protection for staff\nOne third of all participants reported conflicting guidelines related to isolation, mask, and/or respirator use for novel H1N1 patient management\nChanges in PPE guidelines during the response to novel H1N1\n\n5 out of 12 facilities changed PPE use guidelines midway through the response to novel H1N1 in 2009\n34.3% of the facilities also changed their isolation precautions midway through the event\n91.7% of the facilities that changed PPE use also changed isolation precautions midway through the event\nTypes of isolation precautions used for novel H1N1 patients\n\n42.9% of the facilities used airborne and contact isolation\n28.6% of the facilities used airborne isolation alone\n11.4% of the facilities used droplet precautions alone\n14.3% of the facilities used droplet and contact isolation\n22.2% of the facilities that used droplet or droplet and contact isolation for novel H1N1 patients used airborne precautions during aerosolizing procedures\nRecommendation of eye protection for staff\n\n74.3% of the participants reported that their facility recommended staff wear eye protection in addition to other PPE when caring for novel H1N1 patients\nChallenges in decision making during the response to novel H1N1\n\nLack of scientific evidence available to guide decision making\nConflicting recommendations provided by the CDC and WHO\nSwitching recommendations/practice midway through the response created unique challenges for the focus group members\nHealth care staff were hesitant to switch from using a N95 respirator to a surgical mask because of concerns for personal safety\nMany hospitals shied away from using infection prevention practices that were different from the CDC recommendations due to legislation from occupational health and safety act\nFit testing\n\nFit testing is the process of verifying the adequacy and proper fit of a respirator for healthcare workers\nNote: The above summary is based on the provided text, which is a report of a focus group discussion about the response to novel H1N1 in 2009. The focus group participants were healthcare professionals and the discussion centered around the challenges they faced during the response, specifically in terms of PPE use and isolation precautions. The text also mentions the lack of scientific evidence available to guide decision making and the conflicting recommendations provided by the CDC and WHO. Additionally, the text also touches upon the issue of fit testing for healthcare workers.\nFit testing for healthcare workers\n\nThe Occupational Safety and Health Administration (OSHA) requires all healthcare workers to be fit tested prior to respirator use in healthcare settings\nFit testing is a time-consuming process that requires staff and supplies, including various sizes and styles of respirators\nAnnual fit testing is part of most hospitals’ respiratory protection program and is often spread out throughout the year\nImpact of the H1N1 pandemic on fit testing\n\nThe H1N1 pandemic posed unique challenges for hospitals due to the need to fit test a large number of staff in a short period of time\nSome hospitals had difficulty with fit testing due to running out of certain models of respirators and the desire to conserve respirators\nSome hospitals decided to have healthcare workers use powered air purifying respirators (PAPR) instead of N95s as respiratory protection during the pandemic\nIssues with novel H1N1 laboratory testing\n\nAt the start of the novel H1N1 outbreak, many clinicians used the rapid test for seasonal influenza A and B, but the sensitivity of these rapid tests was very low for novel H1N1\nConfirmatory testing consists of reverse-transcription polymerase chain reaction (RT-PCR) or viral culture, which is usually obtained via state health department reference laboratories\nMany patients with negative rapid tests were later found to be positive for novel H1N1 on RT-PCR or viral culture\nInfection prevention issues resulting from the lack of a reliable rapid test for novel H1N1\n\nLack of consistency regarding the use of the rapid test for surveillance or treatment purposes\nTesting only lasted for a short period of time and had very specific rules regarding who could be tested, causing confusion among the general public and making surveillance and control measures more difficult\nPublic's perception about rapid testing\n\nThe public had a lot of confusion and misconceptions about rapid testing for novel H1N1\nImportance of phone triage in pediatric facilities\n\nPediatric facilities generally have off-hours phone triage available to support parents and families\nThis helps to prevent parents from flooding the emergency department and saves money\nChallenges in triaging individuals\n\nThere is a need for indoor or covered areas to triage individuals, especially in warm climates where mosquitoes could be a problem\nHealth care facilities should consider finding ways to bring triage indoors or under shelter to prevent potential disasters\nEducational topics for Infection Preventionists (IPs)\n\nFocus group participants identified the most important educational topics for IPs\nThese topics include isolation precautions, coordination with community response agencies, surge management, and the IP’s role in emergency management\nBest format for educational materials\n\nWritten educational materials need to be translated into multiple languages and made available as soon as possible\nEducational materials should be short (1-2 pages at most), evidence-based, and written in bullet points\nInfection prevention emergency management guidance\n\nInfection prevention recommendations are necessary for non-acute care settings such as ambulatory care centers, physician offices, home health, and long-term care\nThese recommendations should include a stronger focus on occupational health to maintain functionality of health care facilities during surge capacity\nLessons learned from the first part of the 2009 novel H1N1 influenza A pandemic\n\nOccupational health issues need to be addressed to sustain capacity during pandemics\nPolicies and procedures for screening/ triaging staff, furloughing employees, and better sick leave practices are necessary\nChanging standards and recommendations must be communicated carefully to prevent mistrust and confusion\nHealth care professionals should be told that outbreaks of emerging infectious diseases will bring rapidly changing case definitions, surveillance methodologies, and control measures\nConflicting guidance on infection prevention for novel H1N1 has led to confusion and a shortage of supplies\n\nHospitals need better plans for obtaining or reusing necessary equipment and supplies during patient surges\nOne quarter of all focus group participants’ facilities ran out of respiratory protection supplies during the spring of 2009\nAlmost one quarter needed to implement a reuse policy for respirators to conserve limited resources\nLimitations of the study\n\nStructured surveys with closed-ended responses may have revealed different opinions\nThe information presented may not be generalizable to all hospitals\nThe small sample size needed for focus group methodologies may limit the generalizability of the survey results\nConclusion\n\nIPs involvement in preparedness and response to pandemics and other disasters involving a biologic agent is essential\nThe study highlights gaps in emergency management most in need of being addressed: infection prevention in nonacute care settings, employee health during pandemics, communication, PPE availability and recommendations for use\nMaintaining Quality of Care during Rapidly Changing and Conflicting Recommendations\n\nHealthcare professionals (IPs) must continue to address gaps in pandemic planning\nCreation and distribution of IP-specific educational tools and reference materials for emergency management is necessary\nTopics for new educational initiatives should be based on the experiences of IPs who went through the first wave of the 2009 novel H1N1 influenza A pandemic\n","tags":[]}]